## staging: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-10-20T16:02:30Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:005133826942:rpjvmf2ukd/" -> (known after apply)
      ~ id            = "qs8gix" -> (known after apply)
      ~ invoke_url    = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-10-20T16:02:30Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "qs8gix" -> (known after apply)
        id                    = "ags-rpjvmf2ukd-staging"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl.metrics_collection will be updated in-place
  ~ resource "aws_wafv2_web_acl" "metrics_collection" {
        id          = "378af4bf-0cc4-466d-b45f-68231da0cb7a"
        name        = "metrics_collection1"
        tags        = {}
        # (6 unchanged attributes hidden)


      + rule {
          + name     = "metrics_collection_max_body_size"
          + priority = 12

          + action {

              + block {
                  + custom_response {
                      + response_code = 200

                      + response_header {
                          + name  = "waf-block"
                          + value = "metrics_collection_max_body_size"
                        }
                    }
                }
            }

          + statement {

              + size_constraint_statement {
                  + comparison_operator = "GT"
                  + size                = 20480

                  + field_to_match {

                      + body {}
                    }

                  + text_transformation {
                      + priority = 1
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "metrics_collection_max_body_size"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "metrics_collection_max_body_size" -> null
          - priority = 12 -> null

          - action {

              - count {
                }
            }

          - statement {

              - size_constraint_statement {
                  - comparison_operator = "GT" -> null
                  - size                = 20480 -> null

                  - field_to_match {

                      - body {}
                    }

                  - text_transformation {
                      - priority = 1 -> null
                      - type     = "NONE" -> null
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "metrics_collection_max_body_size" -> null
              - sampled_requests_enabled   = true -> null
            }
        }

        # (8 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>